In [1]:
import numpy as np
import pandas as pd

In [2]:
df1 = pd.DataFrame({
    'City': ['New Delhi', 'Mumbai', 'Jalandhar', 'Nagpur'],
    'Temperature': [21, 14, 35, 36]
})

In [3]:
df1

        City  Temperature
0  New Delhi           21
1     Mumbai           14
2  Jalandhar           35
3     Nagpur           36

In [4]:
df1[~df1['City'].isin(df2['City'])]

NameError: name 'df2' is not defined

In [5]:
df2 = pd.DataFrame({
    'City': ['Mumbai', 'New Delhi', 'Trivandrum'],
    'Humidity': [68, 64, 67]
})

In [6]:
df2

         City  Humidity
0      Mumbai        68
1   New Delhi        64
2  Trivandrum        67

In [7]:
#pd.merge(df1, df2, on='City', how='inner')

In [8]:
pd.merge(df1, df2, on='City', how='left')

        City  Temperature  Humidity
0  New Delhi           21      64.0
1     Mumbai           14      68.0
2  Jalandhar           35       NaN
3     Nagpur           36       NaN

In [9]:
pd.merge(df1, df2, on='City', how='outer')

         City  Temperature  Humidity
0   New Delhi         21.0      64.0
1      Mumbai         14.0      68.0
2   Jalandhar         35.0       NaN
3      Nagpur         36.0       NaN
4  Trivandrum          NaN      67.0

In [10]:
pd.merge(df1, df2, on='City', how='right')

         City  Temperature  Humidity
0   New Delhi         21.0        64
1      Mumbai         14.0        68
2  Trivandrum          NaN        67

In [11]:
df = pd.DataFrame({
    'key' : ['A', 'B', 'C', 'A', 'B', 'C'],
    'data1': range(1, 7),
    'data2': np.random.randint(0, 10, 6),
})

In [12]:
df

  key  data1  data2
0   A      1      7
1   B      2      6
2   C      3      7
3   A      4      7
4   B      5      5
5   C      6      8

In [13]:
groups = df.groupby('key')

In [14]:
for key, group in groups:
    print(key)
    print(group)
    print('\n')

A
  key  data1  data2
0   A      1      7
3   A      4      7


B
  key  data1  data2
1   B      2      6
4   B      5      5


C
  key  data1  data2
2   C      3      7
5   C      6      8

In [15]:
groups.std()

       data1     data2
key
A    2.12132  0.000000
B    2.12132  0.707107
C    2.12132  0.707107

In [16]:
def filterfunc(x):
    return x['data2'].std() > 3

In [17]:
groups.filter(filterfunc)

Empty DataFrame
Columns: [key, data1, data2]
Index: []

In [18]:
groups.max()

     data1  data2
key
A        4      7
B        5      6
C        6      8

In [19]:
groups.describe()

    data1                                          data2                      \
    count mean      std  min   25%  50%   75%  max count mean       std  min
key
A     2.0  2.5  2.12132  1.0  1.75  2.5  3.25  4.0   2.0  7.0  0.000000  7.0
B     2.0  3.5  2.12132  2.0  2.75  3.5  4.25  5.0   2.0  5.5  0.707107  5.0
C     2.0  4.5  2.12132  3.0  3.75  4.5  5.25  6.0   2.0  7.5  0.707107  7.0


      25%  50%   75%  max
key
A    7.00  7.0  7.00  7.0
B    5.25  5.5  5.75  6.0
C    7.25  7.5  7.75  8.0

In [20]:
students = pd.read_csv('students.csv')

In [21]:
students

        Name   Course  Marks
0    Shivani     Math     96
1    Shivani  English     94
2  Siddharth  Biology     93
3  Siddharth     Math     94
4  Siddharth  English     97
5     Arushi  English     99

In [22]:
groups = students.groupby(['Course'])

In [23]:
for key, group in groups:
    print(key)
    print(group)

Biology
        Name   Course  Marks
2  Siddharth  Biology     93
English
        Name   Course  Marks
1    Shivani  English     94
4  Siddharth  English     97
5     Arushi  English     99
Math
        Name Course  Marks
0    Shivani   Math     96
3  Siddharth   Math     94

In [24]:
groups.aggregate({'Name': ['min', 'max'], 'Marks':['min', 'max', 'mean']}) #key -> column , value ->functions to apply to that column

              Name            Marks
               min        max   min max       mean
Course
Biology  Siddharth  Siddharth    93  93  93.000000
English     Arushi  Siddharth    94  99  96.666667
Math       Shivani  Siddharth    94  96  95.000000

In [26]:
weather = pd.read_csv('weather_by_cities.csv')

In [27]:
weather

         day      city  temperature  windspeed   event
0   1/1/2017  new york           32          6    Rain
1   1/2/2017  new york           36          7   Sunny
2   1/3/2017  new york           28         12    Snow
3   1/4/2017  new york           33          7   Sunny
4   1/1/2017    mumbai           90          5   Sunny
5   1/2/2017    mumbai           85         12     Fog
6   1/3/2017    mumbai           87         15     Fog
7   1/4/2017    mumbai           92          5    Rain
8   1/1/2017     paris           45         20   Sunny
9   1/2/2017     paris           50         13  Cloudy
10  1/3/2017     paris           54          8  Cloudy
11  1/4/2017     paris           42         10  Cloudy

In [28]:
groups = weather.groupby('city')

In [29]:
for key, group in groups:
    print(key)
    print(group)
    print('\n')

mumbai
        day    city  temperature  windspeed  event
4  1/1/2017  mumbai           90          5  Sunny
5  1/2/2017  mumbai           85         12    Fog
6  1/3/2017  mumbai           87         15    Fog
7  1/4/2017  mumbai           92          5   Rain


new york
        day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny


paris
         day   city  temperature  windspeed   event
8   1/1/2017  paris           45         20   Sunny
9   1/2/2017  paris           50         13  Cloudy
10  1/3/2017  paris           54          8  Cloudy
11  1/4/2017  paris           42         10  Cloudy

In [30]:
groups.aggregate({'temperature':'max', 'windspeed':'mean'})

          temperature  windspeed
city
mumbai             92       9.25
new york           36       8.00
paris              54      12.75

In [31]:
students = pd.read_csv('students.csv')

In [32]:
students

        Name   Course  Marks
0    Shivani     Math     96
1    Shivani  English     94
2  Siddharth  Biology     93
3  Siddharth     Math     94
4  Siddharth  English     97
5     Arushi  English     99

In [33]:
students['Marks'].apply(lambda x: x + 10) #lambda arguments: expression

0    106
1    104
2    103
3    104
4    107
5    109
Name: Marks, dtype: int64

In [34]:
students

        Name   Course  Marks
0    Shivani     Math     96
1    Shivani  English     94
2  Siddharth  Biology     93
3  Siddharth     Math     94
4  Siddharth  English     97
5     Arushi  English     99

In [35]:
students['Marks'].mean()

95.5

In [36]:
students['random_marks'] = np.random.randint(93, 99, 6)

In [37]:
students['random_marks']

0    98
1    94
2    98
3    93
4    97
5    95
Name: random_marks, dtype: int64

In [38]:
students

        Name   Course  Marks  random_marks
0    Shivani     Math     96            98
1    Shivani  English     94            94
2  Siddharth  Biology     93            98
3  Siddharth     Math     94            93
4  Siddharth  English     97            97
5     Arushi  English     99            95

In [39]:
def greater(x): #each row
    if x['Marks'] > x['random_marks']:
        return "MARKS"
    return "RANDOM MARKS"

In [40]:
students['greater'] = students.apply(greater, axis=1)

In [41]:
students

        Name   Course  Marks  random_marks       greater
0    Shivani     Math     96            98  RANDOM MARKS
1    Shivani  English     94            94  RANDOM MARKS
2  Siddharth  Biology     93            98  RANDOM MARKS
3  Siddharth     Math     94            93         MARKS
4  Siddharth  English     97            97  RANDOM MARKS
5     Arushi  English     99            95         MARKS

In [42]:
students.apply(max, axis=0)

Name               Siddharth
Course                  Math
Marks                     99
random_marks              98
greater         RANDOM MARKS
dtype: object